/****************************************************************************
* @作者：				   YYX
* @创建日期：	   2024/7/10
* @最后更新日期：  20247/24
* @所属：				  常熟理工学院
* @功能：	         红外与灰度传感器
 ****************************************************************************/
#include "redandhui.h"
void Red_flag(void)
{
		if(HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_8)==0)  //左边  扫描到东西后
		{
			if(red1_falg==0){red1_go=1;}             //开始的作用：扫描到花暂停   后续的作用：如果执行完舵机后继续向前走
		}
		if(HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_9)==0)
		{
			if(red2_falg==0){red2_go=1;}
		}
}
